#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//数据存储第二节
//大小端存储： 要记住
// 详细看19节
//大三的同学加入知识星球网站，进行学习，有内推码进行实习
// 练习:
//int main()
//{
//	//-128~127
//	char a = -128;
//	printf("%u\n", a);//打印unsigned Char的数据
//	return 0;
//}
//-128是一个整数
//10000000000000000000000010000000
//反码： 
//11111111111111111111111101111111
// 补码：
//11111111111111111111111110000000
// char类型放不下这些数据
// 要进行截断
// 10000000=a
// %u指的是打印无符号的整数
// 要进行整型提升
// 最高位是符号位，按照符号位进行提升
// 11111111111111111111111110000000  当成补码（因为是unsigned）-->=原码
//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//	return 0;
//}
//00000000000000000000000010000000
//11111111111111111111111110000000
//结果和第一个程序是一样的 
// 
//int main()
//{
//	int i = 20;
//	unsigned int j = 10;
//	printf("%u无符号 %d有符号 \n", i + j);
//	return 0;
//}
// 10000000000000000000000000010100
//-20:
// 11111111111111111111111111101100 
// 
// 10:
// 00000000000000000000000000001010
// 
// 11111111111111111111111111110110直接加起来 求和
// 11111111111111111111111111110101  （-1后）
// 10000000000000000000000000001010    原码  ：-10
// 
//#include<windows.h>
//int main()
//{
//	unsigned int i;//无符号数，哪有大于等于0，全是正数
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(1000);
//	}
//	return 0;
//}
// 死循环了
// 
int main()
{
	char a[1000];
	int i;
	for (i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d", strlen(a));
	//strlen是求字符串长度的，找\0的位置，统计\0之前出现多少个字符
	return 0;
}
// char类型总共2byte
// 8bit
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//
//
//
//